&НаКлиенте
Процедура ПриОткрытии(Отказ)
    АдресСервера = ПолучитьАдресProcessNavigator();
    Параметры = "?host=1c&product=" + КодироватьСтроку("1С:ERP", СпособКодированияСтроки.КодировкаURL)
        + "&infobase=" + КодироватьСтроку(ИмяИнформационнойБазы(), СпособКодированияСтроки.КодировкаURL);
    Элементы.Навигатор.Адрес = АдресСервера + Параметры;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресProcessNavigator()
    Возврат PN_СерверИнтеграции.ПолучитьАдресПриложения();
КонецФункции
